hw4/app/controllers/movies_controller.rb

	def find_by_director
		@movie = Movie.find params[:id]
		if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Mel Gibson"]]